"providerDisplayName" = "Contact";
"Return to chat with the contact" = "Return to chat with the contact";
"Add Contact/Group" = "Add Contact/Group";
"Add" = "Add ";
"as Contact or Group" = " as Contact or Group";